<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot). Modified to update an existing Jamf policy.</string>
	<key>Description</key>
	<string>Downloads the latest version of Audacity, uploads the package to Jamf, and updates the existing 'Audacity(Self Service)' policy.</string>
	<key>Identifier</key>
	<string>com.github.Justinbmac.jamf.Audacity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Audacity</string>
		<key>PKG_CATEGORY</key>
		<string>Testing</string> <!-- Or your desired package category -->
		<key>POLICY_NAME</key>
		<string>Audacity(Self Service)</string> <!-- CRITICAL: Exact name of your existing policy, no space -->
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.Justinbmac.pkg.Audacity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<!-- Processor to update the existing policy -->
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>replace_policy</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
