<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Manages Audacity package, Smart Group, and Policy in Jamf.</string>
	<key>Description</key>
	<string>Downloads Audacity, uploads pkg, creates/updates 'Needs Update' Smart Group, and creates/updates 'Audacity(Self Service)' policy.</string>
	<key>Identifier</key>
	<string>com.github.Justinbmac.jamf.Audacity</string>
	<key>Input</key>
	<dict>
		<!-- Core App Info -->
		<key>NAME</key>
		<string>Audacity</string>
		<key>PKG_CATEGORY</key>
		<string>Autopkg Recipes</string>
		<key>APPLICATION_TITLE</key>
		<string>Audacity.app</string> <!-- Exact app bundle name for inventory -->

		<!-- Policy Details -->
		<key>POLICY_TEMPLATE_PATH</key>
		<string>SelfServiceTemplate.xml</string> <!-- Using your chosen simple template -->
		<key>POLICY_NAME</key>
		<string>Audacity(Self Service)</string>
		<key>POLICY_CATEGORY_NAME</key> <!-- For the Policy's category -->
		<string>App Install - Self Service</string>
		<key>POLICY_SITE_NAME</key> <!-- Used by Policy and Smart Group -->
		<string>-1</string> <!-- -1 for "None", or specify site name -->
		<key>POLICY_SCOPE_GROUP_NAME</key> <!-- Was GROUP_NAME in your simple template -->
		<string>Testing</string>

		<!-- Self Service Details for Policy -->
		<key>SELFSERVICE_DESCRIPTION</key>
		<string>Installs Audacity, a free audio editor. Version: %version%.</string>
		<!-- SELFSERVICE_ICON would be needed if your NoPkgID_PolicyTemplate.xml had it -->

		<!-- Smart Group Details -->
		<key>SMART_GROUP_TEMPLATE_PATH</key>
		<string>SmartGroupTemplate.xml</string>
		<key>SMART_GROUP_NAME</key>
		<string>%NAME% - Needs Update (Not v%version%)</string>
		<key>TARGET_GROUP_FOR_VERSION_CHECK</key>
		<string>Testing</string> <!-- Group to check within, e.g., 'Testing' or 'All Managed Clients' -->

		<!-- %version% is inherited from parent recipe -->
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.Justinbmac.pkg.Audacity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY_NAME%</string>
			</dict>
		</dict>

		<!-- Create/Update the Smart Group -->
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
			<key>Arguments</key>
			<dict>
				<key>computergroup_template</key>
				<string>%SMART_GROUP_TEMPLATE_PATH%</string>
				<key>computergroup_name</key>
				<string>%SMART_GROUP_NAME%</string>
				<key>replace_group</key> <!-- Always replace to ensure criteria match latest version -->
				<true/>
			</dict>
		</dict>

		<!-- Create/Update the Policy -->
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE_PATH%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<!-- <key>icon</key><string>%SELFSERVICE_ICON%</string> If your policy template needs it -->
				<key>replace_policy</key>
				<true/>
                <key>GROUP_NAME</key> <!-- For policy scope, matches placeholder in your simple template -->
                <string>%POLICY_SCOPE_GROUP_NAME%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
