<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Manages Audacity package and Policy in Jamf.</string>
	<key>Description</key>
	<string>Downloads Audacity, uploads pkg, and creates/updates 'Audacity(Self Service)' policy.</string>
	<key>Identifier</key>
	<string>com.github.Justinbmac.jamf.Audacity</string>
	<key>Input</key>
	<dict>
		<!-- Core App Info -->
		<key>NAME</key>
		<string>Audacity</string>
		<key>PKG_CATEGORY</key>
		<string>Autopkg Recipes</string>

		<!-- Policy Details -->
		<key>POLICY_TEMPLATE_PATH</key>
		<string>SelfServiceTemplate.xml</string> <!-- Using your simplified template -->
		<key>POLICY_NAME</key>
		<string>Audacity(Self Service)</string>
		<key>POLICY_CATEGORY</key> <!-- Matches placeholder in your template -->
		<string>App Install - Self Service</string>
		<key>GROUP_NAME</key> <!-- Matches placeholder in your template for policy scope -->
		<string>Testing</string>

		<!-- Self Service Details for Policy -->
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Installs Audacity, a free audio editor. Version: %version%.</string>
		<!-- SELFSERVICE_ICON is not in NoPkgID_PolicyTemplate.xml, so no input for it needed here -->
		<!-- %version% is inherited from parent recipe -->
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.Justinbmac.pkg.Audacity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%PKG_CATEGORY%</string>
			</dict>
		</dict>
		<dict> <!-- This is for the POLICY's category -->
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string> <!-- Make sure this variable name matches what's in your input and template -->
			</dict>
		</dict>
		<!-- JamfComputerGroupUploader for Smart Group is REMOVED -->
		<!-- Create/Update the Policy -->
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			<key>Arguments</key>
			<dict>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE_PATH%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>replace_policy</key>
				<true/>
                <key>GROUP_NAME</key> <!-- For policy scope, matches placeholder in your simple template -->
                <string>%GROUP_NAME%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
