Comment: Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of JASP and creates a package.
Identifier: com.github.Justinbmac.pkg.JASP
Input:
  NAME: JASP
MinimumVersion: '2.3'
ParentRecipe: com.github.Justinbmac.download.JASP
Process:
- Processor: AppPkgCreator
