# Comment: Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)
# Modified to update an existing Jamf policy and use an existing icon
Description: Downloads the latest version of JASP, packages it, uploads the package to Jamf Pro, and updates the existing 'JASP (Self Service)' policy to use the new package and the existing 'JASP.png' icon.
Identifier: com.github.Justinbmac.jamf.JASP # Keeping your identifier convention
MinimumVersion: "2.3"
ParentRecipe: com.github.Justinbmac.pkg.JASP # Your existing pkg recipe

Input:
  NAME: JASP # Used potentially by ParentRecipe or for default naming conventions
  PKG_CATEGORY: Software # Category for the package in Jamf Pro
  POLICY_NAME: "JASP (Self Service)" # <<< CRITICAL: Must be the EXACT name of your existing policy in Jamf Pro
  SELFSERVICE_ICON: JASP.png # <<< The exact NAME of the icon you uploaded to Jamf Pro

Process:
  # 1. Ensure the Package Category exists in Jamf Pro
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%PKG_CATEGORY%"

  # 2. Upload the Package generated by the ParentRecipe
  # This processor outputs variables like 'pkg_name' needed by the next step implicitly
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%PKG_CATEGORY%"

  # 3. Find the existing policy by name and update it
  # This will update the package reference AND set the icon using the name provided
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: "%POLICY_NAME%" # Tells the processor which policy to find and update
      icon: "%SELFSERVICE_ICON%" # Tells the processor to use the icon named 'JASP.png' which already exists in Jamf
      replace_policy: True # IMPORTANT: Updates the found policy, including package and icon references.

  # 4. Output summary (optional but helpful)
  - Processor: com.github.grahampugh.recipes.postprocessors/LastRecipeRunResult
